zophai-liu/rtk-zephyr/drivers/serial/uart_rtl87x2g.c
#if DBG_DIRECT_SHOW
    // DBG_DIRECT("[uart_rtl87x2g_poll_out] uart=0x%x, c=%c", (uint32_t)uart, c);
#endif

    UART_SendByte(uart, (uint8_t)c);
}

static int uart_rtl87x2g_err_check(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;

    uint32_t err = 0U;

    if (UART_GetFlagStatus(uart, UART_FLAG_RX_OVERRUN))
    {
        err |= UART_ERROR_OVERRUN;
    }

    if (UART_GetFlagStatus(uart, UART_FLAG_RX_PARITY_ERR))
    {
        err |= UART_ERROR_PARITY;
    }

    if (UART_GetFlagStatus(uart, UART_FLAG_RX_FRAME_ERR))
    {
        err |= UART_ERROR_FRAMING;
    }

    if (UART_GetFlagStatus(uart, UART_FLAG_RX_BREAK_ERR))
    {
        err |= UART_BREAK;
    }

    return err;
}

#ifdef CONFIG_UART_INTERRUPT_DRIVEN

static int uart_rtl87x2g_fifo_fill(const struct device *dev,
                                   const uint8_t *tx_data,
                                   int size)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    uint8_t num_tx = 0U;
    unsigned int key;

    if (!UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY))
    {
        return num_tx;
    }

    /* Lock interrupts to prevent nested interrupts or thread switch */

    key = irq_lock();

    while ((size - num_tx > 0) &&
           UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY))
    {
        UART_SendByte(uart, (uint8_t)tx_data[num_tx++]);
    }

    irq_unlock(key);

#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_fifo_fill] num_tx=%d", num_tx);
#endif
    return num_tx;
}

static int uart_rtl87x2g_fifo_read(const struct device *dev, uint8_t *rx_data,
                                   const int size)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    uint8_t num_rx = 0U;

    while ((size - num_rx > 0) &&
           UART_GetFlagStatus(uart, UART_FLAG_RX_DATA_AVA))
    {
        rx_data[num_rx++] = UART_ReceiveByte(uart);
    }

#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_fifo_read] num_rx=%d", num_rx);
#endif
    return num_rx;
}

static void uart_rtl87x2g_irq_tx_enable(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    struct uart_rtl87x2g_data *data = dev->data;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_tx_enable]");
#endif

    data->tx_int_en = true;
    UART_INTConfig(uart, UART_INT_TX_FIFO_EMPTY, ENABLE);
}

static void uart_rtl87x2g_irq_tx_disable(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    struct uart_rtl87x2g_data *data = dev->data;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_tx_disable]");
#endif

    data->tx_int_en = false;
    UART_INTConfig(uart, UART_INT_TX_FIFO_EMPTY, DISABLE);
}

static int uart_rtl87x2g_irq_tx_ready(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_tx_ready]");
#endif
    return UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY) &&
           data->tx_int_en;
}

static int uart_rtl87x2g_irq_tx_complete(const struct device *dev)
{
    return uart_rtl87x2g_irq_tx_ready(dev);
}

static void uart_rtl87x2g_irq_rx_enable(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    struct uart_rtl87x2g_data *data = dev->data;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_rx_enable]");
#endif

    data->rx_int_en = true;
    UART_INTConfig(uart, UART_INT_RD_AVA, ENABLE);
}

static void uart_rtl87x2g_irq_rx_disable(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    struct uart_rtl87x2g_data *data = dev->data;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_rx_disable]");
#endif

    data->rx_int_en = false;
    UART_INTConfig(uart, UART_INT_RD_AVA, DISABLE);
}

static int uart_rtl87x2g_irq_rx_ready(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_rx_ready]");
#endif

    return UART_GetFlagStatus(uart, UART_FLAG_RX_DATA_AVA);
}

static void uart_rtl87x2g_irq_err_enable(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_err_enable]");
#endif

    UART_INTConfig(uart, UART_INT_RX_LINE_STS, ENABLE);
}

static void uart_rtl87x2g_irq_err_disable(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_err_disable]");
#endif

    UART_INTConfig(uart, UART_INT_RX_LINE_STS, DISABLE);
}

static int uart_rtl87x2g_irq_is_pending(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_is_pending]");
#endif

    return ((UART_GetFlagStatus(uart, UART_FLAG_TX_EMPTY) &&
             data->tx_int_en) ||
            (UART_GetFlagStatus(uart, UART_INT_RD_AVA) &&
             data->rx_int_en));
}

static int uart_rtl87x2g_irq_update(const struct device *dev)
{
    return 1;
}

static void uart_rtl87x2g_irq_callback_set(const struct device *dev,
                                           uart_irq_callback_user_data_t cb,
                                           void *cb_data)
{
    struct uart_rtl87x2g_data *data = dev->data;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_irq_callback_set]");
#endif

    data->user_cb = cb;
    data->user_data = cb_data;
}

#endif /* CONFIG_UART_INTERRUPT_DRIVEN */

#ifdef CONFIG_UART_LINE_CTRL
int uart_rtl87x2g_line_ctrl_set(const struct device *dev, uint32_t ctrl, uint32_t val)
{
    LOG_ERR("Unsupport line_ctrl_set function");
    return -ENOTSUP;
}

int uart_rtl87x2g_line_ctrl_get(const struct device *dev, uint32_t ctrl, uint32_t *val)
{
    LOG_ERR("Unsupport line_ctrl_get function");
    return -ENOTSUP;
}
#endif

#ifdef CONFIG_UART_DRV_CMD
int uart_rtl87x2g_drv_cmd(const struct device *dev, uint32_t cmd, uint32_t p)
{
    LOG_ERR("Unsupport drv_cmd function");
    return -ENOTSUP;
}
#endif
#ifdef CONFIG_UART_ASYNC_API
static inline void async_user_callback(struct uart_rtl87x2g_data *data,
                                       struct uart_event *event)
{
    if (data->async_cb)
    {
        data->async_cb(data->dev, event, data->async_user_data);
    }
}

static inline void async_evt_rx_rdy(struct uart_rtl87x2g_data *data)
{
    LOG_DBG("rx_rdy: (%d %d)", data->dma_rx.offset, data->dma_rx.counter);
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[async_evt_rx_rdy] data->dma_rx.counter=%d, data->dma_rx.offset=%d",
               data->dma_rx.counter, data->dma_rx.offset);
#endif
    struct uart_event event =
    {
        .type = UART_RX_RDY,
        .data.rx.buf = data->dma_rx.buffer,
        .data.rx.len = data->dma_rx.counter - data->dma_rx.offset,
        .data.rx.offset = data->dma_rx.offset
    };

    /* update the current pos for new data */
    data->dma_rx.offset = data->dma_rx.counter;

