zophai-liu/rtk-zephyr/drivers/serial/uart_rtl87x2g.c
    /* send event only for new data */
    if (event.data.rx.len > 0)
    {
        async_user_callback(data, &event);
    }
}

static inline void async_evt_rx_err(struct uart_rtl87x2g_data *data, int err_code)
{
    LOG_DBG("rx error: %d", err_code);

    struct uart_event event =
    {
        .type = UART_RX_STOPPED,
        .data.rx_stop.reason = err_code,
        .data.rx_stop.data.len = data->dma_rx.counter,
        .data.rx_stop.data.offset = 0,
        .data.rx_stop.data.buf = data->dma_rx.buffer
    };

    async_user_callback(data, &event);
}

static inline void async_evt_tx_done(struct uart_rtl87x2g_data *data)
{
    LOG_DBG("tx done: %d", data->dma_tx.counter);

    struct uart_event event =
    {
        .type = UART_TX_DONE,
        .data.tx.buf = data->dma_tx.buffer,
        .data.tx.len = data->dma_tx.counter
    };

    /* Reset tx buffer */
    data->dma_tx.buffer_length = 0;
    data->dma_tx.counter = 0;

    async_user_callback(data, &event);
}

static inline void async_evt_tx_abort(struct uart_rtl87x2g_data *data)
{
    LOG_DBG("tx abort: %d", data->dma_tx.counter);

    struct uart_event event =
    {
        .type = UART_TX_ABORTED,
        .data.tx.buf = data->dma_tx.buffer,
        .data.tx.len = data->dma_tx.counter
    };

    /* Reset tx buffer */
    data->dma_tx.buffer_length = 0;
    data->dma_tx.counter = 0;

    async_user_callback(data, &event);
}

static inline void async_evt_rx_buf_request(struct uart_rtl87x2g_data *data)
{
    struct uart_event evt =
    {
        .type = UART_RX_BUF_REQUEST,
    };

    async_user_callback(data, &evt);
}

static inline void async_evt_rx_buf_release(struct uart_rtl87x2g_data *data)
{
    struct uart_event evt =
    {
        .type = UART_RX_BUF_RELEASED,
        .data.rx_buf.buf = data->dma_rx.buffer,
    };

    async_user_callback(data, &evt);
}

static inline void async_timer_start(struct k_work_delayable *work,
                                     int32_t timeout)
{
    if ((timeout != SYS_FOREVER_US) && (timeout != 0))
    {
        /* start timer */
        LOG_DBG("async timer started for %d us", timeout);
        k_work_reschedule(work, K_USEC(timeout));
    }
}

static void uart_rtl87x2g_dma_rx_flush(const struct device *dev)
{
    struct dma_status stat;
    struct uart_rtl87x2g_data *data = dev->data;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_rx_flush]");
#endif

    if (dma_get_status(data->dma_rx.dma_dev,
                       data->dma_rx.dma_channel, &stat) == 0)
    {
        size_t rx_rcv_len = data->dma_rx.buffer_length -
                            stat.pending_length;
#if DBG_DIRECT_SHOW
        DBG_DIRECT("data->dma_rx.buffer_length=%d, stat.pending_length=%d, rx_rcv_len=%d, data->dma_rx.offset=%d, rx fifo=%d",
                   \
                   data->dma_rx.buffer_length, stat.pending_length, rx_rcv_len, data->dma_rx.offset,
                   UART_GetRxFIFOLen(((struct uart_rtl87x2g_config *)(dev->config))->uart));
#endif
        if (rx_rcv_len > data->dma_rx.offset)
        {
            data->dma_rx.counter = rx_rcv_len;

            async_evt_rx_rdy(data);
        }
    }
}

static inline void uart_rtl87x2g_dma_tx_enable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_tx_enable]");
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    UART_MISCR_TypeDef uart_0x28 = {.d32 = uart->UART_MISCR};
    uart_0x28.b.txdma_en = ENABLE;
    uart_0x28.b.txdma_burstsize = 15;
    uart->UART_MISCR = uart_0x28.d32;
}

static inline void uart_rtl87x2g_dma_tx_disable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_tx_disable]");
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    UART_MISCR_TypeDef uart_0x28 = {.d32 = uart->UART_MISCR};
    uart_0x28.b.txdma_en = DISABLE;
    uart->UART_MISCR = uart_0x28.d32;
}

static inline void uart_rtl87x2g_dma_rx_enable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_rx_enable]");
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
    UART_MISCR_TypeDef uart_0x28 = {.d32 = uart->UART_MISCR};
    uart_0x28.b.rxdma_en = ENABLE;
    uart_0x28.b.rxdma_burstsize = 1;
    uart->UART_MISCR = uart_0x28.d32;

    data->dma_rx.enabled = true;
}

static inline void uart_rtl87x2g_dma_rx_disable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_rx_disable]");
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
    UART_MISCR_TypeDef uart_0x28 = {.d32 = uart->UART_MISCR};
    uart_0x28.b.rxdma_en = DISABLE;
    uart_0x28.b.rxdma_burstsize = 1;
    uart->UART_MISCR = uart_0x28.d32;

    data->dma_rx.enabled = false;
}

void uart_rtl87x2g_dma_tx_cb(const struct device *dma_dev, void *user_data,
                             uint32_t channel, int status)
{
    const struct device *uart_dev = user_data;
    struct uart_rtl87x2g_data *data = uart_dev->data;
    struct dma_status stat;
    unsigned int key = irq_lock();

    /* Disable TX */
    uart_rtl87x2g_dma_tx_disable(uart_dev);

    (void)k_work_cancel_delayable(&data->dma_tx.timeout_work);

    if (!dma_get_status(data->dma_tx.dma_dev,
                        data->dma_tx.dma_channel, &stat))
    {
        data->dma_tx.counter = data->dma_tx.buffer_length -
                               stat.pending_length;
    }

#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_tx_cb] channel=%d, status=%d, dma_tx.counter=%d", channel, status,
               data->dma_tx.counter);
#endif

    data->dma_tx.buffer_length = 0;

    irq_unlock(key);

    dma_stop(data->dma_tx.dma_dev, data->dma_tx.dma_channel);

    /* Generate TX_DONE event when transmission is done */
    async_evt_tx_done(data);
}

static void uart_rtl87x2g_dma_replace_buffer(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_replace_buffer]");
#endif
    const struct device *uart_dev = dev;
    struct uart_rtl87x2g_data *data = uart_dev->data;

    /* Replace the buffer and reload the DMA */
    LOG_DBG("Replacing RX buffer: %d", data->rx_next_buffer_len);

    /* reload DMA */
    data->dma_rx.offset = 0;
    data->dma_rx.counter = 0;
    data->dma_rx.buffer = data->rx_next_buffer;
    data->dma_rx.buffer_length = data->rx_next_buffer_len;
    data->dma_rx.blk_cfg.block_size = data->dma_rx.buffer_length;
    data->dma_rx.blk_cfg.dest_address = (uint32_t)(data->dma_rx.buffer);
    data->rx_next_buffer = NULL;
    data->rx_next_buffer_len = 0;

    dma_reload(data->dma_rx.dma_dev, data->dma_rx.dma_channel,
               data->dma_rx.blk_cfg.source_address,
               data->dma_rx.blk_cfg.dest_address,
               data->dma_rx.blk_cfg.block_size);

