zophai-liu/rtk-zephyr/drivers/serial/uart_rtl87x2g.c
    dma_start(data->dma_rx.dma_dev, data->dma_rx.dma_channel);

    /* Request next buffer */
    async_evt_rx_buf_request(data);
}

void uart_rtl87x2g_dma_rx_cb(const struct device *dma_dev, void *user_data,
                             uint32_t channel, int status)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_rx_cb] channel=%d, status=%d", channel, status);
#endif
    const struct device *uart_dev = user_data;
    struct uart_rtl87x2g_data *data = uart_dev->data;

    if (status < 0)
    {
        async_evt_rx_err(data, status);
        return;
    }

    (void)k_work_cancel_delayable(&data->dma_rx.timeout_work);

    /* true since this functions occurs when buffer if full */
    data->dma_rx.counter = data->dma_rx.buffer_length;

    async_evt_rx_rdy(data);

    if (data->rx_next_buffer != NULL)
    {
#if DBG_DIRECT_SHOW
        DBG_DIRECT("[uart_rtl87x2g_dma_rx_cb] channel=%d, status=%d, data->rx_next_buffer != NULL", channel,
                   status);
#endif
        async_evt_rx_buf_release(data);

        /* replace the buffer when the current
        * is full and not the same as the next
        * one.
        */
        uart_rtl87x2g_dma_replace_buffer(uart_dev);
    }
    else
    {
#if DBG_DIRECT_SHOW
        DBG_DIRECT("[uart_rtl87x2g_dma_rx_cb] channel=%d, status=%d, data->rx_next_buffer == NULL", channel,
                   status);
#endif

        k_work_reschedule(&data->dma_rx.timeout_work, K_TICKS(1));
    }
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_dma_rx_cb] exit");
#endif
}

static int uart_rtl87x2g_async_callback_set(const struct device *dev,
                                            uart_callback_t callback,
                                            void *user_data)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_callback_set]");
#endif
    struct uart_rtl87x2g_data *data = dev->data;

    data->async_cb = callback;
    data->async_user_data = user_data;

    return 0;
}

static int uart_rtl87x2g_async_tx(const struct device *dev,
                                  const uint8_t *tx_data, size_t buf_size, int32_t timeout)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_tx] bufsize=%d, timeout=%d", buf_size, timeout);
#endif
    struct uart_rtl87x2g_data *data = dev->data;
    int ret;

    if (data->dma_tx.dma_dev == NULL)
    {
        return -ENODEV;
    }

    if (data->dma_tx.buffer_length != 0)
    {
        return -EBUSY;
    }

    data->dma_tx.buffer = (uint8_t *)tx_data;
    data->dma_tx.buffer_length = buf_size;
    data->dma_tx.timeout = timeout;

    LOG_DBG("tx: l=%d", data->dma_tx.buffer_length);

    /* set source address */
    data->dma_tx.blk_cfg.source_address = (uint32_t)(data->dma_tx.buffer);
    data->dma_tx.blk_cfg.block_size = data->dma_tx.buffer_length;

    ret = dma_config(data->dma_tx.dma_dev, data->dma_tx.dma_channel,
                     &data->dma_tx.dma_cfg);

    if (ret != 0)
    {
        LOG_ERR("dma tx config error!");
        return -EINVAL;
    }

    /* Start TX timer */
    async_timer_start(&data->dma_tx.timeout_work, data->dma_tx.timeout);

    /* Enable TX DMA requests */
    uart_rtl87x2g_dma_tx_enable(dev);

    if (dma_start(data->dma_tx.dma_dev, data->dma_tx.dma_channel))
    {
        LOG_ERR("UART err: TX DMA start failed!");
        return -EFAULT;
    }

    return 0;
}

static int uart_rtl87x2g_async_tx_abort(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_tx_abort]");
#endif
    struct uart_rtl87x2g_data *data = dev->data;
    size_t tx_buffer_length = data->dma_tx.buffer_length;
    struct dma_status stat;
    if (tx_buffer_length == 0)
    {
        return -EFAULT;
    }

    (void)k_work_cancel_delayable(&data->dma_tx.timeout_work);

    dma_suspend(data->dma_tx.dma_dev, data->dma_tx.dma_channel);

    if (!dma_get_status(data->dma_tx.dma_dev,
                        data->dma_tx.dma_channel, &stat))
    {
        data->dma_tx.counter = tx_buffer_length - stat.pending_length;
    }

    dma_stop(data->dma_tx.dma_dev, data->dma_tx.dma_channel);
    async_evt_tx_abort(data);

    return 0;
}

static int uart_rtl87x2g_async_rx_enable(const struct device *dev,
                                         uint8_t *rx_buf, size_t buf_size, int32_t timeout)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_rx_enable] buf_size=%d, timeout=%d", buf_size, timeout);
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
    int ret;
    uint32_t cnt = UART_GetRxFIFOLen(uart);
    for (uint32_t i = 0; i < cnt; i++)
    {
        UART_ReceiveByte(uart);
    }

    if (data->dma_rx.dma_dev == NULL)
    {
        return -ENODEV;
    }

    if (data->dma_rx.enabled)
    {
        LOG_WRN("RX was already enabled");
        return -EBUSY;
    }

    data->dma_rx.offset = 0;
    data->dma_rx.buffer = rx_buf;
    data->dma_rx.buffer_length = buf_size;
    data->dma_rx.counter = 0;
    data->dma_rx.timeout = timeout;

    /* Disable RX interrupts to let DMA to handle it */
    UART_INTConfig(uart, UART_INT_RD_AVA, DISABLE);

    data->dma_rx.blk_cfg.block_size = buf_size;
    data->dma_rx.blk_cfg.dest_address = (uint32_t)data->dma_rx.buffer;

    ret = dma_config(data->dma_rx.dma_dev, data->dma_rx.dma_channel,
                     &data->dma_rx.dma_cfg);

    if (ret != 0)
    {
        LOG_ERR("UART ERR: RX DMA config failed!");
        return -EINVAL;
    }

    /* Enable RX DMA requests */
    uart_rtl87x2g_dma_rx_enable(dev);

    /* Enable UART_INT_RX_IDLE to define the end of a
    * RX DMA transaction.
    */
    UART_INTConfig(uart, UART_INT_RX_IDLE, DISABLE);
    UART_INTConfig(uart, UART_INT_RX_IDLE, ENABLE);

    if (dma_start(data->dma_rx.dma_dev, data->dma_rx.dma_channel))
    {
        LOG_ERR("UART ERR: RX DMA start failed!");
        return -EFAULT;
    }

    /* Request next buffer */
    async_evt_rx_buf_request(data);

    LOG_DBG("async rx enabled");

    return ret;
}

static int uart_rtl87x2g_async_rx_buf_rsp(const struct device *dev, uint8_t *buf,
                                          size_t len)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_rx_buf_rsp] len=%d", len);
#endif
    struct uart_rtl87x2g_data *data = dev->data;

