zophai-liu/rtk-zephyr/drivers/serial/uart_rtl87x2g.c
    LOG_DBG("replace buffer (%d)", len);
    data->rx_next_buffer = buf;
    data->rx_next_buffer_len = len;

    return 0;
}

static int uart_rtl87x2g_async_rx_disable(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_rx_disable]");
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
    struct uart_event disabled_event =
    {
        .type = UART_RX_DISABLED
    };

    if (!data->dma_rx.enabled)
    {
        async_user_callback(data, &disabled_event);
        return -EFAULT;
    }

    UART_INTConfig(uart, UART_INT_RX_IDLE, DISABLE);

    uart_rtl87x2g_dma_rx_flush(dev);

    async_evt_rx_buf_release(data);

    dma_stop(data->dma_rx.dma_dev, data->dma_rx.dma_channel);

    uart_rtl87x2g_dma_rx_disable(dev);

    (void)k_work_cancel_delayable(&data->dma_rx.timeout_work);

    if (data->rx_next_buffer)
    {
        struct uart_event rx_next_buf_release_evt =
        {
            .type = UART_RX_BUF_RELEASED,
            .data.rx_buf.buf = data->rx_next_buffer,
        };
        async_user_callback(data, &rx_next_buf_release_evt);
    }

    data->rx_next_buffer = NULL;
    data->rx_next_buffer_len = 0;

    /* When async rx is disabled, enable interruptible instance of uart to function normally */

    LOG_DBG("rx: disabled");

    async_user_callback(data, &disabled_event);

    return 0;
}

static void uart_rtl87x2g_async_tx_timeout(struct k_work *work)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_tx_timeout]");
#endif
    struct k_work_delayable *dwork = k_work_delayable_from_work(work);
    struct uart_dma_stream *tx_stream = CONTAINER_OF(dwork,
                                                     struct uart_dma_stream, timeout_work);
    struct uart_rtl87x2g_data *data = CONTAINER_OF(tx_stream,
                                                   struct uart_rtl87x2g_data, dma_tx);
    const struct device *dev = data->dev;

    uart_rtl87x2g_async_tx_abort(dev);

    LOG_DBG("tx: async timeout");
}

static void uart_rtl87x2g_async_rx_timeout(struct k_work *work)
{
    struct k_work_delayable *dwork = k_work_delayable_from_work(work);
    struct uart_dma_stream *rx_stream = CONTAINER_OF(dwork,
                                                     struct uart_dma_stream, timeout_work);
    struct uart_rtl87x2g_data *data = CONTAINER_OF(rx_stream,
                                                   struct uart_rtl87x2g_data, dma_rx);
    const struct device *dev = data->dev;

    LOG_DBG("rx timeout");

#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_rx_timeout] data->dma_rx.counter=%d, data->dma_rx.buffer_length=%d",
               \
               data->dma_rx.counter, data->dma_rx.buffer_length);
#endif
    if (data->dma_rx.counter == data->dma_rx.buffer_length)
    {
        uart_rtl87x2g_async_rx_disable(dev);
    }
    else
    {
        uart_rtl87x2g_dma_rx_flush(dev);
    }
}

static int uart_rtl87x2g_async_init(const struct device *dev)
{
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_async_init]");
#endif
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;

    data->dev = dev;

    if (data->dma_rx.dma_dev != NULL)
    {
        if (!device_is_ready(data->dma_rx.dma_dev))
        {
            return -ENODEV;
        }
    }

    if (data->dma_tx.dma_dev != NULL)
    {
        if (!device_is_ready(data->dma_tx.dma_dev))
        {
            return -ENODEV;
        }
    }

    /* Disable both TX and RX DMA requests */
    uart_rtl87x2g_dma_rx_disable(dev);
    uart_rtl87x2g_dma_tx_disable(dev);

    k_work_init_delayable(&data->dma_rx.timeout_work,
                          uart_rtl87x2g_async_rx_timeout);
    k_work_init_delayable(&data->dma_tx.timeout_work,
                          uart_rtl87x2g_async_tx_timeout);

    /* Configure dma rx config */
    memset(&data->dma_rx.blk_cfg, 0, sizeof(data->dma_rx.blk_cfg));

    data->dma_rx.blk_cfg.source_address = (uint32_t)(&(uart->UART_RBR_THR));


    data->dma_rx.blk_cfg.dest_address = 0; /* dest not ready */
    data->dma_rx.blk_cfg.source_addr_adj = data->dma_rx.src_addr_increment;
    data->dma_rx.blk_cfg.dest_addr_adj = data->dma_rx.dst_addr_increment;

    /* RX disable circular buffer */
    data->dma_rx.blk_cfg.source_reload_en  = 0;
    data->dma_rx.blk_cfg.dest_reload_en = 0;

    data->dma_rx.dma_cfg.head_block = &data->dma_rx.blk_cfg;
    data->dma_rx.dma_cfg.user_data = (void *)dev;
    data->rx_next_buffer = NULL;
    data->rx_next_buffer_len = 0;

    /* Configure dma tx config */
    memset(&data->dma_tx.blk_cfg, 0, sizeof(data->dma_tx.blk_cfg));

    data->dma_tx.blk_cfg.dest_address = (uint32_t)(&(uart->UART_RBR_THR));

    data->dma_tx.blk_cfg.source_address = 0; /* not ready */

    data->dma_tx.blk_cfg.source_addr_adj = data->dma_tx.src_addr_increment;

    data->dma_tx.blk_cfg.dest_addr_adj = data->dma_tx.dst_addr_increment;

    data->dma_tx.dma_cfg.head_block = &data->dma_tx.blk_cfg;
    data->dma_tx.dma_cfg.user_data = (void *)dev;

    return 0;
}

#endif /* CONFIG_UART_ASYNC_API */

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || \
    defined(CONFIG_UART_ASYNC_API)

static void uart_rtl87x2g_isr(const struct device *dev)
{
    struct uart_rtl87x2g_data *data = dev->data;
    const struct uart_rtl87x2g_config *config = dev->config;
    UART_TypeDef *uart = config->uart;
    UART_GetIID(uart);
    if (data->user_cb)
    {
        data->user_cb(dev, data->user_data);
    }

#ifdef CONFIG_UART_ASYNC_API
    if (UART_GetFlagStatus(uart, UART_FLAG_RX_IDLE))
    {
        LOG_DBG("idle interrupt occurred");
        if (data->dma_rx.timeout == 0)
        {
#if DBG_DIRECT_SHOW
            DBG_DIRECT("[uart_rtl87x2g_isr] UART_FLAG_RX_IDLE timeout == 0");
#endif
            uart_rtl87x2g_dma_rx_flush(dev);
        }
        else
        {
#if DBG_DIRECT_SHOW
            dma_suspend(data->dma_rx.dma_dev, data->dma_rx.dma_channel);
            DBG_DIRECT("[uart_rtl87x2g_isr] dma len=%d",
                       GDMA_GetTransferLen(GDMA_GetGDMAChannelx(data->dma_rx.dma_channel)));
            dma_resume(data->dma_rx.dma_dev, data->dma_rx.dma_channel);
#endif

            /* Start the RX timer not null */
            UART_INTConfig(uart, UART_INT_RX_IDLE, DISABLE);
            UART_INTConfig(uart, UART_INT_RX_IDLE, ENABLE);
            async_timer_start(&data->dma_rx.timeout_work,
                              data->dma_rx.timeout);
        }
    }

