zophai-liu/rtk-zephyr/drivers/serial/uart_rtl87x2g.c
    /* Clear errors */
    uart_rtl87x2g_err_check(dev);
#endif /* CONFIG_UART_ASYNC_API */
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_isr] exit");
#endif
}
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_PM_DEVICE
static int uart_rtl87x2g_pm_action(const struct device *dev,
                                   enum pm_device_action action)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    UART_TypeDef *uart = config->uart;
    int err;
    extern void UART_DLPSEnter(void *PeriReg, void *StoreBuf);
    extern void UART_DLPSExit(void *PeriReg, void *StoreBuf);

    switch (action)
    {
    case PM_DEVICE_ACTION_SUSPEND:

        UART_DLPSEnter(uart, &data->store_buf);

        /* Move pins to sleep state */
        err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_SLEEP);
        if ((err < 0) && (err != -ENOENT))
        {
            return err;
        }
        break;
    case PM_DEVICE_ACTION_RESUME:
        /* Set pins to active state */
        err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
        if (err < 0)
        {
            return err;
        }

        UART_DLPSExit(uart, &data->store_buf);

        break;
    default:
        return -ENOTSUP;
    }

    return 0;
}
#endif /* CONFIG_PM_DEVICE */

static const struct uart_driver_api uart_rtl87x2g_driver_api =
{
    .poll_in = uart_rtl87x2g_poll_in,
    .poll_out = uart_rtl87x2g_poll_out,
    .err_check = uart_rtl87x2g_err_check,
#ifdef CONFIG_UART_USE_RUNTIME_CONFIGURE
    .configure = uart_rtl87x2g_configure,
    .config_get = uart_rtl87x2g_config_get,
#endif /* CONFIG_UART_USE_RUNTIME_CONFIGURE */

#ifdef CONFIG_UART_INTERRUPT_DRIVEN
    .fifo_fill = uart_rtl87x2g_fifo_fill,
    .fifo_read = uart_rtl87x2g_fifo_read,
    .irq_tx_enable = uart_rtl87x2g_irq_tx_enable,
    .irq_tx_disable = uart_rtl87x2g_irq_tx_disable,
    .irq_tx_ready = uart_rtl87x2g_irq_tx_ready,
    .irq_tx_complete = uart_rtl87x2g_irq_tx_complete,
    .irq_rx_enable = uart_rtl87x2g_irq_rx_enable,
    .irq_rx_disable = uart_rtl87x2g_irq_rx_disable,
    .irq_rx_ready = uart_rtl87x2g_irq_rx_ready,
    .irq_err_enable = uart_rtl87x2g_irq_err_enable,
    .irq_err_disable = uart_rtl87x2g_irq_err_disable,
    .irq_is_pending = uart_rtl87x2g_irq_is_pending,
    .irq_update = uart_rtl87x2g_irq_update,
    .irq_callback_set = uart_rtl87x2g_irq_callback_set,
#endif  /* CONFIG_UART_INTERRUPT_DRIVEN */

#ifdef CONFIG_UART_ASYNC_API
    .callback_set = uart_rtl87x2g_async_callback_set,
    .tx = uart_rtl87x2g_async_tx,
    .tx_abort = uart_rtl87x2g_async_tx_abort,
    .rx_enable = uart_rtl87x2g_async_rx_enable,
    .rx_buf_rsp = uart_rtl87x2g_async_rx_buf_rsp,
    .rx_disable = uart_rtl87x2g_async_rx_disable,
#endif  /* CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_LINE_CTRL
    .line_ctrl_set = uart_rtl87x2g_line_ctrl_set,
    .line_ctrl_get = uart_rtl87x2g_line_ctrl_get,
#endif

#ifdef CONFIG_UART_DRV_CMD
    .drv_cmd = uart_rtl87x2g_drv_cmd,
#endif
};

/**
 * @brief Initialize UART channel
 *
 * This routine is called to reset the chip in a quiescent state.
 * It is assumed that this function is called only once per UART.
 *
 * @param dev UART device struct
 *
 * @return 0
 */
static int uart_rtl87x2g_init(const struct device *dev)
{
    const struct uart_rtl87x2g_config *config = dev->config;
    struct uart_rtl87x2g_data *data = dev->data;
    int err;
#if DBG_DIRECT_SHOW
    DBG_DIRECT("[uart_rtl87x2g_init]");
#endif
    data->dev = dev;

    (void)clock_control_on(RTL87X2G_CLOCK_CONTROLLER,
                           (clock_control_subsys_t)&config->clkid);

    /* Configure pinmux  */

    err = pinctrl_apply_state(config->pcfg, PINCTRL_STATE_DEFAULT);
    if (err < 0)
    {
        return err;
    }

    /* Configure peripheral  */

    err = uart_rtl87x2g_configure(dev, &data->uart_config);
    if (err)
    {
        return err;
    }

    /* Enable nvic */
#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || \
    defined(CONFIG_UART_ASYNC_API)
    config->irq_config_func(dev);
#endif /* CONFIG_UART_INTERRUPT_DRIVEN || CONFIG_UART_ASYNC_API */

#ifdef CONFIG_UART_ASYNC_API
    return uart_rtl87x2g_async_init(dev);
#else
    return 0;
#endif
}

#ifdef CONFIG_UART_ASYNC_API

#define UART_DMA_CHANNEL_INIT(index, dir)            \
    .dma_dev = DEVICE_DT_GET(RTL87X2G_DMA_CTLR(index, dir)),         \
               .dma_channel = DT_INST_DMAS_CELL_BY_NAME(index, dir, channel),          \
                              .dma_cfg = {                                  \
                                                                            .dma_slot = DT_INST_DMAS_CELL_BY_NAME(index, dir, slot),            \
                                                                            .channel_direction = RTL87X2G_DMA_CONFIG_DIRECTION(         \
                                                                                    RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),           \
                                                                            .channel_priority = RTL87X2G_DMA_CONFIG_PRIORITY(        \
                                                                                    RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),       \
                                                                            .source_data_size = RTL87X2G_DMA_CONFIG_SOURCE_DATA_SIZE(          \
                                                                                    RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),        \
                                                                            .dest_data_size = RTL87X2G_DMA_CONFIG_DESTINATION_DATA_SIZE(         \
                                                                                    RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),         \
                                                                            .source_burst_length = RTL87X2G_DMA_CONFIG_SOURCE_MSIZE(        \
                                                                                    RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),         \
                                                                            .dest_burst_length = RTL87X2G_DMA_CONFIG_DESTINATION_MSIZE(        \
                                                                                    RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),         \
                                                                            .block_count = 1,              \
                                                                            .dma_callback = uart_rtl87x2g_dma_##dir##_cb,          \
                                         },                                  \
                                         .src_addr_increment = RTL87X2G_DMA_CONFIG_SOURCE_ADDR_INC(          \
                                                               RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),          \
                                                               .dst_addr_increment = RTL87X2G_DMA_CONFIG_DESTINATION_ADDR_INC(        \
                                                                       RTL87X2G_DMA_CHANNEL_CONFIG(index, dir)),         \

#endif

