zophai-liu/rtk-zephyr/drivers/serial/uart_rtl87x2g.c
#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
#define RTL87X2G_UART_IRQ_HANDLER_DECL(index)               \
    static void uart_rtl87x2g_irq_config_func_##index(const struct device *dev);
#define RTL87X2G_UART_IRQ_HANDLER(index)                    \
    static void uart_rtl87x2g_irq_config_func_##index(const struct device *dev) \
    {                                   \
        IRQ_CONNECT(DT_INST_IRQN(index),                \
                    DT_INST_IRQ(index, priority),               \
                    uart_rtl87x2g_isr, DEVICE_DT_INST_GET(index),       \
                    0);                         \
        irq_enable(DT_INST_IRQN(index));                \
    }
#else
#define RTL87X2G_UART_IRQ_HANDLER_DECL(index) /* Not used */
#define RTL87X2G_UART_IRQ_HANDLER(index) /* Not used */
#endif

#if defined(CONFIG_UART_INTERRUPT_DRIVEN) || defined(CONFIG_UART_ASYNC_API)
#define RTL87X2G_UART_IRQ_HANDLER_FUNC(index)               \
    .irq_config_func = uart_rtl87x2g_irq_config_func_##index,
#else
#define RTL87X2G_UART_IRQ_HANDLER_FUNC(index) /* Not used */
#endif

#ifdef CONFIG_UART_ASYNC_API
#define UART_DMA_CHANNEL(index, dir)    \
    .dma_##dir = {                         \
                                           COND_CODE_1(DT_INST_DMAS_HAS_NAME(index, dir),               \
                                                       (UART_DMA_CHANNEL_INIT(index, dir)),           \
                                                       (NULL))                      \
                 },
#else
#define UART_DMA_CHANNEL(index, dir)
#endif

#define RTL87X2G_UART_INIT(index)                                          \
    RTL87X2G_UART_IRQ_HANDLER_DECL(index)                                   \
    \
    PINCTRL_DT_INST_DEFINE(index);                                            \
    \
    static const struct uart_rtl87x2g_config uart_rtl87x2g_cfg_##index = {      \
        .uart = (UART_TypeDef *)DT_INST_REG_ADDR(index),                        \
                .clkid = DT_INST_CLOCKS_CELL(index, id),            \
                         .pcfg = PINCTRL_DT_INST_DEV_CONFIG_GET(index),                            \
                                 .hw_flow_ctrl = DT_INST_PROP_OR(index, flow_ctrl, false),                 \
                                                 RTL87X2G_UART_IRQ_HANDLER_FUNC(index)                                       \
    };                                                                               \
    \
    static struct uart_rtl87x2g_data uart_rtl87x2g_data_##index = {                    \
        .uart_config = {                                                             \
                                                                                     .baudrate = DT_INST_PROP(index, current_speed),                           \
                                                                                     .parity = DT_INST_ENUM_IDX_OR(index, parity, UART_CFG_PARITY_NONE),       \
                                                                                     .stop_bits = DT_INST_ENUM_IDX_OR(index, stop_bits, UART_CFG_STOP_BITS_1),\
                                                                                     .data_bits = DT_INST_ENUM_IDX_OR(index, data_bits, UART_CFG_DATA_BITS_8),\
                                                                                     .flow_ctrl = DT_INST_PROP(index, hw_flow_control),                       \
                       },              \
                       UART_DMA_CHANNEL(index, rx)                     \
                       UART_DMA_CHANNEL(index, tx)                    \
    };                                                                       \
    \
     PM_DEVICE_DT_INST_DEFINE(index, uart_rtl87x2g_pm_action);    \
     DEVICE_DT_INST_DEFINE(index,                                              \
                          &uart_rtl87x2g_init,                                  \
                          PM_DEVICE_DT_INST_GET(index),                           \
                          &uart_rtl87x2g_data_##index, &uart_rtl87x2g_cfg_##index,    \
                          PRE_KERNEL_1, CONFIG_SERIAL_INIT_PRIORITY,                    \
                          &uart_rtl87x2g_driver_api);                                  \
    \
    RTL87X2G_UART_IRQ_HANDLER(index)

DT_INST_FOREACH_STATUS_OKAY(RTL87X2G_UART_INIT)
